app/Models/LearningMaterials/ContentTypeModel.php

SELECT *
FROM `content_types`
ORDER BY `id`
SELECT *
FROM `content_types`
---
    public function listForSelect(): array
    {
        return $this->orderBy('id')->findAll()
            ? array_column($this->findAll(), 'name', 'id')