app/Models/LearningMaterials/TopicModel.php

SELECT *
FROM `topics`
ORDER BY `id`
SELECT *
FROM `topics`
---
    public function listForSelect(): array
    {
        return $this->orderBy('id')->findAll()
            ? array_column($this->findAll(), 'name', 'id')