app/Services/LearningMaterials/AllLearningMaterialsService.php

SELECT COUNT(*) AS `numrows`
FROM `learning_materials`
SELECT `id`, `user_id`, `course_id`, `content_type_id`, `first_language`, `topics`, `status`, `created_at`
FROM `learning_materials`
ORDER BY `id` DESC
 LIMIT 20
---
    public function listAll(AllLearningMaterialsQueryDTO $dto): array
    {
        $total  = (clone $this->learningMaterials)->countAllResults();
        $offset = ($dto->page - 1) * $dto->per_page;

        $contentRows = (clone $this->learningMaterials)
            ->select('id, user_id, course_id, content_type_id, first_language, topics, status, created_at')
            ->orderBy('id', 'DESC')
            ->findAll($dto->per_page, $offset);

SELECT `id`, `name`, `surname`
FROM `users`
WHERE `id` IN (1)
---
    private function hydrateContents(array $contentRows): array
    {
        $learningMaterialIds = array_map(static fn(array $row) => (int) $row['id'], $contentRows);
        $userIds    = array_unique(array_map(static fn(array $row) => (int) ($row['user_id'] ?? 0), $contentRows));

        $translationRows = $this->translations
            ->whereIn('learning_material_id', $learningMaterialIds)
            ->select('content_id, lang, title, short_title, self_description')
            ->findAll();

        $translationsByContent = [];
        foreach ($translationRows as $row) {
            $cid  = (int) $row['learning_material_id'];
            $lang = (string) $row['lang'];
            $translationsByContent[$cid][$lang] = $row;
        }

        $userMap = [];
        if (! empty($userIds)) {
            $userRows = $this->users
                ->select('id, name, surname')
                ->whereIn('id', $userIds)
                ->findAll();