app/Services/LearningMaterials/LearningMaterialWizardService.php

SELECT `id`, `name`
FROM `institution_types`
ORDER BY `name` ASC
---
    public function getInstitutionTypes(): array
    {
        // InstitutionTypes için basit bir model kullanacağız
        $db = db_connect();
        $rows = $db->table('institution_types')
            ->select('id, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `institutions`
WHERE `institutions`.`id` = '5'
SELECT *
FROM `titles`
WHERE `titles`.`id` = '18'
SELECT *
FROM `countries`
WHERE `countries`.`id` = '164'
---
    private function buildDefaultAuthorFromSessionUser(): ?array
    {
        $userId = (int) (session('user_id') ?? 0);
        if ($userId <= 0) {
            return null;
        }

        $users = model(UserModel::class);
        $institutions = model(InstitutionModel::class);
        $titles = model(TitleModel::class);
        $countries = model(CountryModel::class);

        $user = $users->find($userId);
        if (!$user) {
            return null;
        }

        $institution = $user['institution_id'] ? $institutions->find($user['institution_id']) : null;
        $title = $user['title_id'] ? $titles->find($user['title_id']) : null;
        $country = $user['country_id'] ? $countries->find($user['country_id']) : null;