app/Services/LearningMaterials/LearningMaterialEditorService.php

SELECT `id`
FROM `learning_material_editors`
WHERE   (
`editor_id` = 1
OR LOWER(editor_email) = 'saziyeedag@gmail.com'
 )
 LIMIT 1
---
    public function userHasAssignments(int $userId, string $email): bool
    {
        $email = strtolower(trim($email));
        if ($userId <= 0 && $email === '') {
            return false;
        }

        $builder = $this->editors->builder('learning_material_editors');
        $builder->select('id');
        $builder->limit(1);

        if ($userId > 0 && $email !== '') {
            $builder->groupStart()
                ->where('editor_id', $userId)
                ->orWhere('LOWER(editor_email)', $email)
                ->groupEnd();
        } elseif ($userId > 0) {
            $builder->where('editor_id', $userId);
        } else {
            $builder->where('LOWER(editor_email)', $email);
        }

        $row = $builder->get()->getFirstRow();