app/Services/LearningMaterials/MyLearningMaterialsService.php

    public function listMine(int $userId, MyLearningMaterialsQueryDTO $dto): array
    {
        $total = (clone $this->learningMaterials)
            ->where('user_id', $userId)
            ->countAllResults();

        $offset = ($dto->page - 1) * $dto->per_page;

        $contentRows = (clone $this->learningMaterials)
            ->select('id, course_id, content_type_id, first_language, topics, status, created_at')
            ->where('user_id', $userId)
            ->orderBy('id', 'DESC')
            ->findAll($dto->per_page, $offset);
---
SELECT COUNT(*) AS `numrows`
FROM `learning_materials`
WHERE `user_id` = 1
SELECT `id`, `course_id`, `content_type_id`, `first_language`, `topics`, `status`, `created_at`
FROM `learning_materials`
WHERE `user_id` = 1
ORDER BY `id` DESC
 LIMIT 20