app/Services/LearningMaterials/ReviewerLearningMaterialsService.php

SELECT `learning_material_reviewers`.`learning_material_id`
FROM `learning_material_reviewers`
INNER JOIN `learning_materials` ON `learning_materials`.`id` = `learning_material_reviewers`.`learning_material_id`
WHERE `learning_material_reviewers`.`reviewer_id` = 1
AND `learning_material_reviewers`.`decision_code` IS NULL
AND `learning_materials`.`status` = 'korhakemlik'
ORDER BY `learning_material_reviewers`.`assigned_at` DESC
---
    public function listAssigned(int $userId, MyLearningMaterialsQueryDTO $dto): array
    {
        $learningMaterialIds = $this->reviewers
            ->select('learning_material_reviewers.learning_material_id')
            ->join('learning_materials', 'learning_materials.id = learning_material_reviewers.learning_material_id', 'inner')
            ->where('learning_material_reviewers.reviewer_id', $userId)
            ->where('learning_material_reviewers.decision_code', null)   // ⇦ ekleyin
            ->where('learning_materials.status', 'korhakemlik')
            ->orderBy('learning_material_reviewers.assigned_at', 'DESC')
            ->findAll();