app/Models/Users/CountryModel.php

SELECT `code`, `name`
FROM `countries`
ORDER BY `name` ASC
---
    public function asRichMap(): array
    {
        $rows = $this->builder()
            ->select('code, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();