app/Models/Users/İnstitutionModel.php

    public function asMap(): array
    {
        $builder = $this->builder()->select('id, name');

        if ($this->db->fieldExists('status', $this->table)) {
            $builder->where('status', 1);
        }

        $builder->orderBy('name', 'ASC');

        $rows = $builder->get()->getResultArray();
---
SELECT `id`, `name`
FROM `institutions`
ORDER BY `name` ASC