app/Models/Users/TitleModel.php

SELECT `id`, `name`
FROM `titles`
ORDER BY `name` ASC
---
    public function asMap(): array
    {
        $builder = $this->builder()->select('id, name');

        if ($this->db->fieldExists('status', $this->table)) {
            $builder->where('status', 1);
        }

        if ($this->db->fieldExists('sort', $this->table)) {
            $builder->orderBy('sort', 'ASC');
        } else {
            $builder->orderBy('name', 'ASC');
        }

        $rows = $builder->get()->getResultArray();