app/Models/Users/UserModel.php

SELECT `ur`.`role_id`, `r`.`role_name`
FROM `user_roles` `ur`
JOIN `roles` `r` ON `r`.`id` = `ur`.`role_id`
WHERE `ur`.`user_id` = 1
---
    public function getUserRoleIn(int $userId): array
    {
        return $this->db->table('user_roles ur')
            ->select('ur.role_id, r.role_name')
            ->join('roles r', 'r.id = ur.role_id')
            ->where('ur.user_id', $userId)
            ->get()
            ->getResultArray();