app/Services/Users/UserDetailService.php

SELECT `u`.`id`, `u`.`name`, `u`.`surname`, `u`.`mail`, `u`.`phone`, `u`.`created_at`, `t`.`name` AS `title_name`, `c`.`name` AS `country_name`, `i`.`name` AS `institution_name`, `i`.`city` AS `institution_city`
FROM `users` `u`
LEFT JOIN `titles` `t` ON `t`.`id` = `u`.`title_id`
LEFT JOIN `countries` `c` ON `c`.`id` = `u`.`country_id`
LEFT JOIN `institutions` `i` ON `i`.`id` = `u`.`institution_id`
WHERE `u`.`id` = 6
---
    private function fetchUserSummary(int $userId): array
    {
        $row = $this->db->table('users u')
            ->select([
                'u.id',
                'u.name',
                'u.surname',
                'u.mail',
                'u.phone',
                'u.created_at',
                't.name AS title_name',
                'c.name AS country_name',
                'i.name AS institution_name',
                'i.city AS institution_city',
            ])
            ->join('titles t', 't.id = u.title_id', 'left')
            ->join('countries c', 'c.id = u.country_id', 'left')
            ->join('institutions i', 'i.id = u.institution_id', 'left')
            ->where('u.id', $userId)
            ->get()
            ->getRowArray();

SELECT `id`, `role_name`
FROM `roles`
ORDER BY `role_name` ASC
---
    private function fetchRoleMap(): array
    {
        $rows = $this->db->table('roles')
            ->select('id, role_name')
            ->orderBy('role_name', 'ASC')
            ->get()
            ->getResultArray();

SELECT `r`.`id`, `r`.`role_name`
FROM `user_roles` `ur`
LEFT JOIN `roles` `r` ON `r`.`id` = `ur`.`role_id`
WHERE `ur`.`user_id` = 6
ORDER BY `r`.`role_name` ASC
---
    private function fetchUserRoles(int $userId): array
    {
        $rows = $this->db->table('user_roles ur')
            ->select('r.id, r.role_name')
            ->join('roles r', 'r.id = ur.role_id', 'left')
            ->where('ur.user_id', $userId)
            ->orderBy('r.role_name', 'ASC')
            ->get()
            ->getResultArray();

SELECT `a`.`id`, `a`.`created_at`, `a`.`status`, `a`.`first_language`
FROM `contents` `a`
WHERE `a`.`user_id` = 6
ORDER BY `a`.`created_at` DESC
---
    private function fetchArticles(int $userId): array
    {
        $rows = $this->db->table('contents a')
            ->select('a.id, a.created_at, a.status, a.first_language')
            ->where('a.user_id', $userId)
            ->orderBy('a.created_at', 'DESC')
            ->get()
            ->getResultArray();