app/Services/Courses/CourseListService.php

SELECT `courses`.`id` AS `id`, `courses`.`title` AS `title`, `courses`.`description` AS `description`, `courses`.`status` AS `status`, `courses`.`start_date` AS `start_date`, `courses`.`end_date` AS `end_date`, `courses`.`indefinite` AS `indefinite`, `courses`.`created_at` AS `created_at`, `courses`.`updated_at` AS `updated_at`
FROM `courses`
ORDER BY `courses`.`created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `courses`
---
    public function listAll(ListCoursesDTO $dto, ?int $managerUserId = null): array
    {
        try {
            $builder = $this->model
                ->select([
                    'courses.id AS id',
                    'courses.title AS title',
                    'courses.description AS description',
                    'courses.status AS status',
                    'courses.start_date AS start_date',
                    'courses.end_date AS end_date',
                    'courses.indefinite AS indefinite',
                    'courses.created_at AS created_at',
                    'courses.updated_at AS updated_at'
                ]);

            if ($managerUserId !== null) {
                $builder
                    ->join('course_authorities ea', 'ea.course_id = courses.id', 'inner')
                    ->where('ea.user_id', $managerUserId)
                    ->distinct();
            }

            $builder->orderBy('courses.' . $dto->orderBy, $dto->orderDir);

            // Toplam kayıt
            $total = $builder->countAllResults(false);