app/Controllers/Users/ProfileUpdateController.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function edit()
    {
        $userId = (int) (session()->get('user_id') ?? 1); // Demo için ID 1 kullan

        $user = $this->userModel->find($userId);

SELECT `code`
FROM `countries`
WHERE `id` = 100
 LIMIT 1
---
    private function resolveCountryCode(?int $countryId): ?string
    {
        if ($countryId === null || $countryId <= 0) {
            return null;
        }

        $row = $this->countryModel
            ->select('code')
            ->where('id', $countryId)
            ->first();