app/Controllers/Users/UsersController.php

SELECT `users`.`id`, `users`.`name`, `users`.`surname`, `users`.`mail`, `users`.`created_at`
FROM `users`
INNER JOIN `user_roles` `ur` ON `ur`.`user_id` = `users`.`id`
WHERE `ur`.`role_id` = 1
GROUP BY `users`.`id`
ORDER BY `users`.`id` DESC
SELECT `id`, `role_name`
FROM `roles`
ORDER BY `role_name` ASC
---
    public function index()
    {
        $roleParam = (string) ($this->request->getGet('role') ?? '');
        $selectedRole = ctype_digit($roleParam) ? $roleParam : ''; // güvenli sayısal kontrol

        // Kullanıcılar
        $userM = new UserModel();
        $userM->select('users.id, users.name, users.surname, users.mail, users.created_at')
            ->orderBy('users.id', 'DESC');

        if ($selectedRole !== '') {
            $userM->join('user_roles ur', 'ur.user_id = users.id', 'inner')
                ->where('ur.role_id', (int) $selectedRole)
                ->groupBy('users.id'); // aynı kullanıcıya birden fazla rol varsa duplicates engelle
        }

        $users = $userM->findAll();

        // Tüm roller (tablar + modal)
        $roleM = new RolesModel();
        $roles = $roleM->select('id, role_name')
            ->orderBy('role_name', 'ASC')
            ->findAll();

SELECT `user_roles`.`user_id`, `roles`.`id` as `role_id`, `roles`.`role_name`
FROM `user_roles`
LEFT JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` IN ('6','5','4','3','2','1')
ORDER BY `user_roles`.`user_id` ASC
---
    private function getRolesGroupedByUser(array $userIds = []): array
    {
        $pivot = new UserRoleModel();

        $builder = $pivot->select('user_roles.user_id, roles.id as role_id, roles.role_name')
            ->join('roles', 'roles.id = user_roles.role_id', 'left')
            ->orderBy('user_roles.user_id', 'ASC');

        if (!empty($userIds)) {
            $builder->whereIn('user_roles.user_id', $userIds);
        }

        $rows = $builder->findAll();

SELECT `id`, `name`, `surname`, `mail`
FROM `users`
ORDER BY `name` ASC
---
public function optionsAll() // GET /api/users/options
{
    $userM = new UserModel();
    $rows = $userM->select('id, name, surname, mail')
        ->orderBy('name', 'ASC')
        ->findAll();